{
    "Version": "1.1.0.12",
    "Notes": "'## Release Notes ### 🚀 Features - **New Design Applied**: A new design has been applied to the application, enhancing its visual appeal. - **Settings Loader with New Hotkey Feature**: The application now includes a settings loader that allows users to manage various settings including hotkeys. ### 🐞 Bug Fixes - **Update Installer Version and Paths**: The installer version and paths have been updated to 1.1.0.12, ensuring compatibility and improved functionality. - **Sign Installer.py and Sign_release.py**: Various bugs in the signing scripts have been fixed, improving the reliability of the installation process. - **File Paths Consistency**: File paths across different parts of the application have been standardized, making it easier to manage and maintain. ### 🛠️ Maintenance & Refactoring - **Improved Warmup Logic in MainFormViewModel**: The warmup logic has been improved for better performance and user experience. - **Refactor AppColors.cs**: The `AppColors.cs` file has been refactored to use more readable color values, enhancing the overall visual appeal of the application. - **Update Global Hotkey Service**: The global hotkey service has been updated to use new hotkey settings, ensuring that the application can handle various keyboard shortcuts effectively. - **Add Settings Form with Various Settings and Hotkey Functionality**: A new settings form has been added with various settings and hotkey functionality, making it easier for users to customize their experience. - **Update Tray Location in MainForm.resx**: The tray location in `MainForm.resx` has been updated, ensuring that the application icon is displayed correctly on the system tray. - **Update Form UI Based on Current Stage**: The form UI has been updated based on the current stage of the application, enhancing the user experience. - **WebDialog.cs to Include Resize and Drag Functionality**: The `WebDialog.cs` file now includes resize and drag functionality, making it easier for users to interact with web pages. - **Update WebDialog.resx**: Various bug fixes have been made in `WebDialog.resx`, improving the overall usability of the application. ### 🛠️ Maintenance & Refactoring - **Remove Unused Files**: A number of unused files have been removed, freeing up space and improving the application's performance. ## Conclusion This release includes several new features, bug fixes, and maintenance improvements to enhance the user experience. The new design has been applied, and various settings and hotkey functionality have been added. The warmup logic has been improved for better performance, and the global hotkey service has been updated to use new settings. The tray location in `MainForm.resx` has been updated, and the form UI has been updated based on the current stage. The web dialog now includes resize and drag functionality, and various bug fixes have been made in `WebDialog.resx`. Overall, this release represents a significant improvement to the application, making it more user-friendly and efficient.'"
}
